//========================================================================
//	STCunio Studio淘宝http://shop112966725.taobao.com
//	STCunio Studio QQ群:117112538
//	作者：mingbozhu
//	联系方式：13724273732
//	邮箱：mingbozhu@yeah.net
//	修改日期2014.11.7
//	版本V1.1
//========================================================================

/*************	功能说明	**************

本文件为STC15xxx系列的延时程序,用户几乎可以不修改这个程序.

******************************************/

#include	"delay.h"
#include	"STC15Fxxxx.H"
//========================================================================
// 函数: delay_ms(u32 ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数. 自动适应主时钟.
// 返回: none.
// 版本: VER1.1
// 日期: 2014-11-7
// 备注: 
//========================================================================

void  delay_ms(u32 ms)
{
     unsigned int i;
	 do{
	      i = MAIN_Fosc / 13000;
		  while(--i)	;   //14T per loop
     }while(--ms);
}
//========================================================================
// 函数: delay_us(u8 _us)
// 描述: 延时函数。
// 参数: _us,要延时的us数. 自动适应主时钟.
// 返回: none.
// 版本: VER1.1
// 日期: 2014-11-7
// 备注: 
//========================================================================
void delay_us(u8 _us)
{
	 do{	
		 #if MAIN_Fosc==5529600L
		 NOP(1);
		 #elif MAIN_Fosc==11059200L
		 NOP(7);
		 #elif MAIN_Fosc==12000000L
		 NOP(8);
		 #elif MAIN_Fosc==18432000L
		 NOP(14);
		 #elif MAIN_Fosc==20000000L
		 NOP(15);
		 #elif MAIN_Fosc==22118400L
		 NOP(17);
		 #elif MAIN_Fosc==24000000L
		  NOP(20);
		 #elif MAIN_Fosc==27000000L
		 NOP(22);
		 #elif MAIN_Fosc==30000000L
		 NOP(24);
		 #elif MAIN_Fosc==33000000L
		 NOP(27);
		 #elif MAIN_Fosc==33177600L
		 NOP(27);
		 #endif
     }
		while(--_us);
}



//========================================================================
// 函数: delay_10us(u16 _10us)
// 描述: 延时函数。
// 参数: _10us,要延时的10us数. 自动适应主时钟.
// 返回: none.
// 版本: VER1.1
// 日期: 2014-11-7
// 备注: 
//========================================================================
void delay_10us(u16 _10us)
{
 		unsigned int i;
	 do{
	      i = MAIN_Fosc / 1400000;
		  while(--i)	;   //14T per loop
     }while(--_10us);
}

